patchew-project/qemu/include/hw/mips/pic32mk.h
/*
 * PIC32MK GPK/MCM with CAN FD — shared constants
 * Datasheet: DS60001519E
 *
 * Copyright (c) 2026 QEMU contributors
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#ifndef HW_MIPS_PIC32MK_H
#define HW_MIPS_PIC32MK_H

/*
 * Physical memory map (§4, pp. 70-73)
 * -----------------------------------------------------------------------
 */

#define PIC32MK_RAM_BASE        0x00000000u   /* 256 KB SRAM */
#define PIC32MK_RAM_SIZE        (256 * 1024)

#define PIC32MK_PFLASH_BASE     0x1D000000u   /* 1 MB Program Flash */
#define PIC32MK_PFLASH_SIZE     (1 * 1024 * 1024)

/*
 * Boot vector ROM — fills the gap between the MIPS reset vector (0x1FC00000)
 * and Boot Flash 1 (0x1FC40000). Contains a trampoline that jumps to BFlash1.
 */
#define PIC32MK_BOOTVEC_BASE    0x1FC00000u   /* physical reset vector */
#define PIC32MK_BOOTVEC_SIZE    0x00040000u   /* 256 KB gap to BFlash1 */

#define PIC32MK_BFLASH1_BASE    0x1FC40000u   /* Boot Flash 1 — enlarged for firmware */
#define PIC32MK_BFLASH1_SIZE    (256 * 1024)

#define PIC32MK_BFLASH2_BASE    0x1FC60000u   /* Boot Flash 2 ~20 KB */
#define PIC32MK_BFLASH2_SIZE    (20 * 1024)

#define PIC32MK_SFR_BASE        0x1F800000u   /* SFR window, 1 MB */
#define PIC32MK_SFR_SIZE        (1 * 1024 * 1024)

/* Reset vector (KSEG1 uncached alias of 0x1FC00000) */
#define PIC32MK_RESET_VECTOR    0xBFC00000u

/*
 * SFR sub-block bases (offsets within the 1 MB SFR window, Table 4-2)
 * All addresses below are KSEG1 virtual (0xBF800000 + offset).
 * -----------------------------------------------------------------------
 */

/* CFG / PMD block (0xBF800000)                                           */
#define PIC32MK_CFG_OFFSET      0x000000u
#define PIC32MK_CFG_SIZE        0x000900u   /* CFGCON..CFGCON2+INV + CHECON@0x800 */

/* CRU — Clock Reference Unit (0xBF801200)                                 */
#define PIC32MK_CRU_OFFSET      0x001200u
#define PIC32MK_CRU_SIZE        0x0001A0u   /* OSCCON..CLKSTAT+INV inclusive */

/* PPS (Peripheral Pin Select) input/output registers (0xBF801400–0xBF8017FF) */
#define PIC32MK_PPS_OFFSET      0x001400u
#define PIC32MK_PPS_SIZE        0x000400u

/* WDT register block (0xBF800C00) */
#define PIC32MK_WDT_OFFSET      0x000C00u
#define PIC32MK_WDT_SIZE        0x000040u   /* WDTCON + SET/CLR/INV + padding */

/* EVIC                                         0xBF810000 */
#define PIC32MK_EVIC_OFFSET     0x010000u

/* DMA (shares page with EVIC)                  0xBF811000 */
#define PIC32MK_DMA_OFFSET      0x011000u

/* Timers / IC / OC / I2C1-2 / SPI1-2 / UART1-2 / PWM / QEI / CMP / CDAC1 */
#define PIC32MK_PER1_OFFSET     0x020000u   /* 0xBF820000, size 0xD000 */

/* I2C3-4 / SPI3-6 / UART3-6 / CDAC2-3         0xBF840000 */
#define PIC32MK_PER2_OFFSET     0x040000u

/* GPIO PORTA-PORTG                             0xBF860000 */
#define PIC32MK_GPIO_OFFSET     0x060000u

/* CAN1-4 / ADC                                 0xBF880000 */
#define PIC32MK_CAN_OFFSET      0x080000u

/*
 * CAN1–4 SFR offsets from SFR base
 * Verified against DS60001519E / p32mk1024mcm100.h:
 *   CFD1CON @ 0xBF880000, CFD2CON @ 0xBF881000,
 *   CFD3CON @ 0xBF884000, CFD4CON @ 0xBF885000
 */
#define PIC32MK_CAN1_OFFSET     0x080000u   /* physical 0x1F880000 */
#define PIC32MK_CAN2_OFFSET     0x081000u   /* physical 0x1F881000 */
#define PIC32MK_CAN3_OFFSET     0x084000u   /* physical 0x1F884000 */
#define PIC32MK_CAN4_OFFSET     0x085000u   /* physical 0x1F885000 */
#define PIC32MK_CAN_SFR_SIZE    0x1000u     /* 4 KB SFR block per instance */

/*
 * Message RAM physical base per instance.
 * Allocated just above the SFR window, beyond the ADC / USB blocks.
 * ⚠  Verify exact addresses from DS60001519E §4 before final integration.
 * Each instance gets 76 KB (75 KB data + alignment).
 */
#define PIC32MK_CAN1_MSGRAM_BASE 0x1F900000u
#define PIC32MK_CAN2_MSGRAM_BASE 0x1F913000u
#define PIC32MK_CAN3_MSGRAM_BASE 0x1F926000u
#define PIC32MK_CAN4_MSGRAM_BASE 0x1F939000u
#define PIC32MK_CAN_MSGRAM_SIZE  (75u * 1024u)  /* max 74 KB, rounded up */

/*
 * USB OTG 1   _USB_BASE_ADDRESS = 0xBF889040 (p32mk1024mcm100.h / xc.h)
 * struct usb_registers_t pointer starts at 0xBF889040 (= device_base + 0x040).
 * Device MMIO window starts at 0xBF889000 so UxOTGIR lands at offset 0x040.
 */
#define PIC32MK_USB1_OFFSET     0x089000u
#define PIC32MK_USB_OFFSET      PIC32MK_USB1_OFFSET   /* legacy alias */

/* USB OTG 2   _USB2_BASE_ADDRESS = 0xBF88A040 */
#define PIC32MK_USB2_OFFSET     0x08A000u

/* RTCC                                         0xBF8C0000 */
#define PIC32MK_RTCC_OFFSET     0x0C0000u

/*
 * Reset-control registers (§7, p. 114) — offsets from SFR base
 * -----------------------------------------------------------------------
 */

#define PIC32MK_RCON_OFFSET     0x001240u   /* Reset Control */
#define PIC32MK_RSWRST_OFFSET   0x001250u   /* Software Reset trigger */
#define PIC32MK_RNMICON_OFFSET  0x001260u   /* NMI Control */
#define PIC32MK_PWRCON_OFFSET   0x001270u   /* Power Control */

/* RCON reset flags (§7 register map) */
#define PIC32MK_RCON_POR        (1u << 2)   /* Power-on Reset */
#define PIC32MK_RCON_BOR        (1u << 3)   /* Brown-out Reset */

/*
 * CFG / PMD registers (§6) — offsets from PIC32MK_CFG_OFFSET (0xBF800000)
 * -----------------------------------------------------------------------
 */

#define PIC32MK_CFGCON          0x0000u     /* Configuration control */
#define PIC32MK_SYSKEY          0x0030u     /* System key unlock */
#define PIC32MK_PMD1            0x0040u     /* Peripheral Module Disable 1 */
#define PIC32MK_PMD2            0x0050u
#define PIC32MK_PMD3            0x0060u
#define PIC32MK_PMD4            0x0070u
#define PIC32MK_PMD5            0x0080u
#define PIC32MK_PMD6            0x0090u
#define PIC32MK_PMD7            0x00A0u
#define PIC32MK_CFGCON2         0x0110u     /* Extended configuration control */
#define PIC32MK_CHECON          0x0800u     /* Prefetch Cache Control (CHECON) */

/* CFGCON bits */
#define PIC32MK_CFGCON_PGLOCK   (1u << 28)  /* Permission-group lock */
#define PIC32MK_CFGCON_PMDLOCK  (1u << 29)  /* PMD lock */
#define PIC32MK_CFGCON_IOLOCK   (1u << 30)  /* I/O lock */

/* Number of PMD registers */
#define PIC32MK_PMD_COUNT       7

