patchew-project/qemu/include/hw/mips/pic32mk.h
/*
 * CRU registers (§9) — offsets from PIC32MK_CRU_OFFSET (0xBF801200)
 * Each register has SET/CLR/INV aliases at +4/+8/+C.
 * -----------------------------------------------------------------------
 */

/* Oscillator / PLL registers */
#define PIC32MK_CRU_OSCCON      0x00u       /* Oscillator Control */
#define PIC32MK_CRU_OSCTUN      0x10u       /* Oscillator Tuning */
#define PIC32MK_CRU_SPLLCON     0x20u       /* System PLL Control */
#define PIC32MK_CRU_UPLLCON     0x30u       /* USB PLL Control */

/* Reset-control registers (formerly in separate RCON stub) */
#define PIC32MK_CRU_RCON        0x40u       /* Reset Control */
#define PIC32MK_CRU_RSWRST      0x50u       /* Software Reset trigger */
#define PIC32MK_CRU_RNMICON     0x60u       /* NMI Control */
#define PIC32MK_CRU_PWRCON      0x70u       /* Power Control */

/* Reference clock outputs 1–4 (CON + TRIM pairs, 0x20 stride) */
#define PIC32MK_CRU_REFO1CON    0x80u
#define PIC32MK_CRU_REFO1TRIM   0x90u
#define PIC32MK_CRU_REFO2CON    0xA0u
#define PIC32MK_CRU_REFO2TRIM   0xB0u
#define PIC32MK_CRU_REFO3CON    0xC0u
#define PIC32MK_CRU_REFO3TRIM   0xD0u
#define PIC32MK_CRU_REFO4CON    0xE0u
#define PIC32MK_CRU_REFO4TRIM   0xF0u

/* Peripheral bus clock dividers 1–7 (0x10 stride) */
#define PIC32MK_CRU_PB1DIV      0x100u
#define PIC32MK_CRU_PB2DIV      0x110u
#define PIC32MK_CRU_PB3DIV      0x120u
#define PIC32MK_CRU_PB4DIV      0x130u
#define PIC32MK_CRU_PB5DIV      0x140u
#define PIC32MK_CRU_PB6DIV      0x150u
#define PIC32MK_CRU_PB7DIV      0x160u

/* Clock status */
#define PIC32MK_CRU_CLKSTAT     0x190u

/* Number of reference clocks and peripheral buses */
#define PIC32MK_CRU_NREFO       4
#define PIC32MK_CRU_NPB         7

/* OSCCON bits (§9, Register 9-1) */
#define PIC32MK_OSCCON_OSWEN    (1u << 0)
#define PIC32MK_OSCCON_SOSCEN   (1u << 1)
#define PIC32MK_OSCCON_CF       (1u << 3)
#define PIC32MK_OSCCON_SLPEN    (1u << 4)
#define PIC32MK_OSCCON_CLKLOCK  (1u << 7)
#define PIC32MK_OSCCON_NOSC_MASK  0x00000700u   /* bits [10:8] */
#define PIC32MK_OSCCON_NOSC_SHIFT 8
#define PIC32MK_OSCCON_COSC_MASK  0x00007000u   /* bits [14:12] */
#define PIC32MK_OSCCON_COSC_SHIFT 12
#define PIC32MK_OSCCON_FRCDIV_MASK  0x07000000u /* bits [26:24] */
#define PIC32MK_OSCCON_FRCDIV_SHIFT 24

/* SPLLCON bits (§9, Register 9-4) */
#define PIC32MK_SPLLCON_PLLRANGE_MASK  0x00000007u /* bits [2:0] */
#define PIC32MK_SPLLCON_PLLICLK  (1u << 7)
#define PIC32MK_SPLLCON_PLLIDIV_MASK   0x00000700u /* bits [10:8] */
#define PIC32MK_SPLLCON_PLLMULT_MASK   0x007F0000u /* bits [22:16] */
#define PIC32MK_SPLLCON_PLLODIV_MASK   0x07000000u /* bits [26:24] */

/* UPLLCON bits (§9) — same layout as SPLLCON plus UPOSCEN */
#define PIC32MK_UPLLCON_UPOSCEN  (1u << 25)

/* REFOxCON bits (§9, Register 9-16) */
#define PIC32MK_REFOCON_ROSEL_MASK  0x0000000Fu /* bits [3:0] */
#define PIC32MK_REFOCON_ACTIVE   (1u << 8)
#define PIC32MK_REFOCON_DIVSWEN  (1u << 9)
#define PIC32MK_REFOCON_RSLP     (1u << 11)
#define PIC32MK_REFOCON_OE       (1u << 12)
#define PIC32MK_REFOCON_SIDL     (1u << 13)
#define PIC32MK_REFOCON_ON       (1u << 15)
#define PIC32MK_REFOCON_RODIV_MASK  0xFFFF0000u /* bits [31:16] */

/* PBxDIV bits (§9) */
#define PIC32MK_PBDIV_PBDIV_MASK  0x0000007Fu  /* bits [6:0] */
#define PIC32MK_PBDIV_PBDIVRDY   (1u << 11)
#define PIC32MK_PBDIV_ON         (1u << 15)

/* CLKSTAT bits (§9, Register 9-31) */
#define PIC32MK_CLKSTAT_FRCRDY   (1u << 0)
#define PIC32MK_CLKSTAT_POSCRDY  (1u << 2)
#define PIC32MK_CLKSTAT_SOSCRDY  (1u << 4)
#define PIC32MK_CLKSTAT_LPRCRDY  (1u << 5)
#define PIC32MK_CLKSTAT_SPLLRDY  (1u << 7)
#define PIC32MK_CLKSTAT_UPLLRDY  (1u << 8)
#define PIC32MK_CLKSTAT_ALL_RDY  (PIC32MK_CLKSTAT_FRCRDY  | \
                                  PIC32MK_CLKSTAT_POSCRDY  | \
                                  PIC32MK_CLKSTAT_SOSCRDY  | \
                                  PIC32MK_CLKSTAT_LPRCRDY  | \
                                  PIC32MK_CLKSTAT_SPLLRDY  | \
                                  PIC32MK_CLKSTAT_UPLLRDY)

/*
 * EVIC registers (§8, p. 159) — offsets from 0xBF810000
 * -----------------------------------------------------------------------
 */

#define PIC32MK_EVIC_INTCON     0x0000u     /* MVEC, TPC, INTxEP */
#define PIC32MK_EVIC_PRISS      0x0010u     /* Priority shadow reg select */
#define PIC32MK_EVIC_INTSTAT    0x0020u     /* Last IRQ serviced, SRIPL */
#define PIC32MK_EVIC_IPTMR      0x0030u     /* Interrupt proximity timer */
#define PIC32MK_EVIC_IFS0       0x0040u     /* Interrupt flag status [0..7] */
#define PIC32MK_EVIC_IEC0       0x00C0u     /* Interrupt enable control [0..7] */
#define PIC32MK_EVIC_IPC0       0x0140u     /* Interrupt priority control [0..63] */
#define PIC32MK_EVIC_OFF0       0x0540u     /* Vector address offsets [0..190] */

/*
 * Number of interrupt sources / vectors.
 * The EVIC IFS/IEC registers span 8×32 = 256 bits; USB1 (244) and USB2 (246)
 * are in IFS7.  Use 256 to cover the full IPC/IFS table.
 */
#define PIC32MK_NUM_IRQ_SOURCES 256
#define PIC32MK_NUM_VECTORS     190

/*
 * UART1 registers (§21, Table 21-2) — U1MODE base 0xBF828000
 * Offset from SFR base: 0x028000
 * -----------------------------------------------------------------------
 */

#define PIC32MK_UART1_OFFSET    0x028000u   /* SFR offset → physical 0x1F828000 */
#define PIC32MK_UART1_SIZE      0x000050u   /* U1MODE..U1BRG+INV */

/* Register offsets within the UART block (same layout for all UARTs) */
#define PIC32MK_UxMODE          0x00u       /* Mode */
#define PIC32MK_UxSTA           0x10u       /* Status & control */
#define PIC32MK_UxTXREG         0x20u       /* TX data */
#define PIC32MK_UxRXREG         0x30u       /* RX data */
#define PIC32MK_UxBRG           0x40u       /* Baud rate */

/* U1STA bits relevant to TX polling */
#define PIC32MK_USTA_TRMT       (1u << 8)   /* TX shift register empty (1=empty) */
#define PIC32MK_USTA_UTXBF      (1u << 9)   /* TX buffer full (0=not full) */

/*
 * CPU clock (§3)
 * -----------------------------------------------------------------------
 */

