patchew-project/qemu/include/hw/mips/pic32mk.h
#define PIC32MK_CPU_HZ          120000000u  /* 120 MHz max */

/*
 * Interrupt source numbers (§8, Table 8-1, DS60001519E)
 * TODO: verify each number against the actual datasheet table.
 * -----------------------------------------------------------------------
 */

#define PIC32MK_IRQ_CT          0    /* Core Timer */
#define PIC32MK_IRQ_CS0         1    /* Core Software Interrupt 0 */
#define PIC32MK_IRQ_CS1         2    /* Core Software Interrupt 1 */
#define PIC32MK_IRQ_INT0        3    /* External Interrupt 0 */
#define PIC32MK_IRQ_T1          4    /* Timer 1 */
#define PIC32MK_IRQ_T2          9    /* Timer 2 */
#define PIC32MK_IRQ_T3          14   /* Timer 3 */
#define PIC32MK_IRQ_T4          19   /* Timer 4 */
#define PIC32MK_IRQ_T5          24   /* Timer 5 */
#define PIC32MK_IRQ_T6          28   /* Timer 6 */
#define PIC32MK_IRQ_T7          32   /* Timer 7 */
#define PIC32MK_IRQ_T8          36   /* Timer 8 */
#define PIC32MK_IRQ_T9          40   /* Timer 9 */
/* UART1: error=38, RX=39, TX=40  (IFS1 bits 6/7/8, p32mk1024mcm100.h) */
#define PIC32MK_IRQ_U1E         38
#define PIC32MK_IRQ_U1RX        39
#define PIC32MK_IRQ_U1TX        40
#define PIC32MK_IRQ_U2E         115
#define PIC32MK_IRQ_U2RX        116
#define PIC32MK_IRQ_U2TX        117
#define PIC32MK_IRQ_U3E         118
#define PIC32MK_IRQ_U3RX        119
#define PIC32MK_IRQ_U3TX        120
#define PIC32MK_IRQ_U4E         121
#define PIC32MK_IRQ_U4RX        122
#define PIC32MK_IRQ_U4TX        123
#define PIC32MK_IRQ_U5E         124
#define PIC32MK_IRQ_U5RX        125
#define PIC32MK_IRQ_U5TX        126
#define PIC32MK_IRQ_U6E         127
#define PIC32MK_IRQ_U6RX        128
#define PIC32MK_IRQ_U6TX        129
/* CAN FD — single IRQ per instance (§8, Table 8-1, DS60001519E) */
#define PIC32MK_IRQ_CAN1        167
#define PIC32MK_IRQ_CAN2        168
#define PIC32MK_IRQ_CAN3        187
#define PIC32MK_IRQ_CAN4        188

/*
 * USB OTG — interrupt vector numbers from XC32 p32mk1024mcm100.h
 * USB1: vector 34 → IFS1 bit 2, IPC8[18:16]
 * USB2: vector 244 → IFS7 bit 20, IPC61[2:0]
 */
#define PIC32MK_IRQ_USB1        34
#define PIC32MK_IRQ_USB2        244

/* DMA channels 0-7 */
#define PIC32MK_IRQ_DMA0        134
#define PIC32MK_IRQ_DMA1        135
#define PIC32MK_IRQ_DMA2        136
#define PIC32MK_IRQ_DMA3        137
#define PIC32MK_IRQ_DMA4        138
#define PIC32MK_IRQ_DMA5        139
#define PIC32MK_IRQ_DMA6        140
#define PIC32MK_IRQ_DMA7        141

/*
 * GPIO Change-Notice interrupt vectors (DS60001519E Table 8-1,
 * _CHANGE_NOTICE_x_VECTOR from p32mk1024mcm100.h)
 */
#define PIC32MK_IRQ_CNA         44
#define PIC32MK_IRQ_CNB         45
#define PIC32MK_IRQ_CNC         46
#define PIC32MK_IRQ_CND         47
#define PIC32MK_IRQ_CNE         48
#define PIC32MK_IRQ_CNF         49
#define PIC32MK_IRQ_CNG         50

/*
 * Timer peripheral registers (§14, DS60001519E)
 * Offsets from PIC32MK_PER1_OFFSET (0xBF820000).
 * Each timer block is 0x200 bytes; register stride 0x10 (with SET/CLR/INV).
 * TODO: verify exact base offsets for PIC32MK GPK from Table 4-2.
 * -----------------------------------------------------------------------
 */

/* Timer base offsets from SFR base */
#define PIC32MK_T1_OFFSET       0x020000u   /* Timer 1 (Type A, 16-bit) */
#define PIC32MK_T2_OFFSET       0x020200u   /* Timer 2 (Type B) */
#define PIC32MK_T3_OFFSET       0x020400u   /* Timer 3 (Type C) */
#define PIC32MK_T4_OFFSET       0x020600u   /* Timer 4 (Type B) */
#define PIC32MK_T5_OFFSET       0x020800u   /* Timer 5 (Type C) */
#define PIC32MK_T6_OFFSET       0x020A00u   /* Timer 6 (Type B) */
#define PIC32MK_T7_OFFSET       0x020C00u   /* Timer 7 (Type C) */
#define PIC32MK_T8_OFFSET       0x020E00u   /* Timer 8 (Type B) */
#define PIC32MK_T9_OFFSET       0x021000u   /* Timer 9 (Type C) */

#define PIC32MK_TIMER_BLOCK_SIZE    0x200u  /* per-timer SFR block */

/* Timer register offsets within block (with SET/CLR/INV at +4/+8/+C) */
#define PIC32MK_TxCON           0x00u   /* Control: ON, TCKPS, T32, TCS... */
#define PIC32MK_TMRx            0x10u   /* Current count */
#define PIC32MK_PRx             0x20u   /* Period register */

/* TxCON bits */
#define PIC32MK_TCON_ON         (1u << 15)  /* Timer ON */
#define PIC32MK_TCON_T32        (1u << 3)   /* 32-bit mode (Type B only) */
#define PIC32MK_TCON_TCS        (1u << 1)   /* Clock source select */
#define PIC32MK_TCON_TCKPS_MASK 0x0070u     /* Prescaler bits [6:4] */
#define PIC32MK_TCON_TCKPS_SHIFT    4

/*
 * OC (Output Compare) register offsets from SFR base (§19, DS60001519E)
 * OC1-OC9:  0xBF824000..0xBF825000 (0x200 stride)
 * OC10-OC16: 0xBF845200..0xBF845E00 (0x200 stride)
 * -----------------------------------------------------------------------
 */
#define PIC32MK_OC1_OFFSET      0x024000u
#define PIC32MK_OC2_OFFSET      0x024200u
#define PIC32MK_OC3_OFFSET      0x024400u
#define PIC32MK_OC4_OFFSET      0x024600u
#define PIC32MK_OC5_OFFSET      0x024800u
#define PIC32MK_OC6_OFFSET      0x024A00u
#define PIC32MK_OC7_OFFSET      0x024C00u
#define PIC32MK_OC8_OFFSET      0x024E00u
#define PIC32MK_OC9_OFFSET      0x025000u
#define PIC32MK_OC10_OFFSET     0x045200u
#define PIC32MK_OC11_OFFSET     0x045400u
#define PIC32MK_OC12_OFFSET     0x045600u
#define PIC32MK_OC13_OFFSET     0x045800u
#define PIC32MK_OC14_OFFSET     0x045A00u
#define PIC32MK_OC15_OFFSET     0x045C00u
#define PIC32MK_OC16_OFFSET     0x045E00u

#define PIC32MK_OC_BLOCK_SIZE   0x200u

/* OC register offsets within each 0x200-byte block */
#define PIC32MK_OCxCON          0x00u   /* Control */
#define PIC32MK_OCxR            0x10u   /* Primary compare value */
#define PIC32MK_OCxRS           0x20u   /* Secondary compare value */

/* OCxCON bits (Register 19-1) */
#define PIC32MK_OCCON_ON        (1u << 15)
#define PIC32MK_OCCON_SIDL      (1u << 13)
#define PIC32MK_OCCON_OC32      (1u << 5)
#define PIC32MK_OCCON_OCFLT     (1u << 4)
#define PIC32MK_OCCON_OCTSEL    (1u << 3)
#define PIC32MK_OCCON_OCM_MASK  0x0007u
#define PIC32MK_OCCON_OCM_SHIFT 0

/* OC interrupt vector numbers */
#define PIC32MK_IRQ_OC1         7
#define PIC32MK_IRQ_OC2         12
#define PIC32MK_IRQ_OC3         17
#define PIC32MK_IRQ_OC4         22
#define PIC32MK_IRQ_OC5         27
#define PIC32MK_IRQ_OC6         79
#define PIC32MK_IRQ_OC7         83
#define PIC32MK_IRQ_OC8         87
#define PIC32MK_IRQ_OC9         91
#define PIC32MK_IRQ_OC10        199
#define PIC32MK_IRQ_OC11        202
#define PIC32MK_IRQ_OC12        205
#define PIC32MK_IRQ_OC13        208
#define PIC32MK_IRQ_OC14        211
#define PIC32MK_IRQ_OC15        214
#define PIC32MK_IRQ_OC16        217

