patchew-project/qemu/include/hw/mips/pic32mk.h
/*
 * Input Capture (IC1–IC16) — §18, DS60001519E
 * IC1–IC9:   SFR bank 1, base 0xBF822000, stride 0x200
 * IC10–IC16: SFR bank 2, base 0xBF843200, stride 0x200
 * -----------------------------------------------------------------------
 */
#define PIC32MK_IC1_OFFSET      0x022000u
#define PIC32MK_IC2_OFFSET      0x022200u
#define PIC32MK_IC3_OFFSET      0x022400u
#define PIC32MK_IC4_OFFSET      0x022600u
#define PIC32MK_IC5_OFFSET      0x022800u
#define PIC32MK_IC6_OFFSET      0x022A00u
#define PIC32MK_IC7_OFFSET      0x022C00u
#define PIC32MK_IC8_OFFSET      0x022E00u
#define PIC32MK_IC9_OFFSET      0x023000u
#define PIC32MK_IC10_OFFSET     0x043200u
#define PIC32MK_IC11_OFFSET     0x043400u
#define PIC32MK_IC12_OFFSET     0x043600u
#define PIC32MK_IC13_OFFSET     0x043800u
#define PIC32MK_IC14_OFFSET     0x043A00u
#define PIC32MK_IC15_OFFSET     0x043C00u
#define PIC32MK_IC16_OFFSET     0x043E00u

#define PIC32MK_IC_BLOCK_SIZE   0x200u

/* IC register offsets within each block */
#define PIC32MK_ICxCON          0x00u   /* Control (+ SET/CLR/INV at +4/+8/+C) */
#define PIC32MK_ICxBUF          0x10u   /* Capture buffer (read-only FIFO pop) */

/* ICxCON bits (Register 18-1, DS60001519E) */
#define PIC32MK_ICCON_ON        (1u << 15)  /* Module enable */
#define PIC32MK_ICCON_SIDL      (1u << 13)  /* Stop in idle */
#define PIC32MK_ICCON_FEDGE     (1u << 9)   /* First edge select */
#define PIC32MK_ICCON_C32       (1u << 8)   /* 32-bit capture mode */
#define PIC32MK_ICCON_ICTMR     (1u << 7)   /* Timer source select */
#define PIC32MK_ICCON_ICI_MASK  0x0060u     /* Interrupt on every Nth capture [6:5] */
#define PIC32MK_ICCON_ICI_SHIFT 5
#define PIC32MK_ICCON_ICOV      (1u << 4)   /* Overflow (buffer full) */
#define PIC32MK_ICCON_ICBNE     (1u << 3)   /* Buffer not empty */
#define PIC32MK_ICCON_ICM_MASK  0x0007u     /* Capture mode [2:0] */

/* IC IRQ numbers (Table 8-3, DS60001519E) — paired: error IRQ, capture IRQ */
#define PIC32MK_IRQ_IC1E        5
#define PIC32MK_IRQ_IC1         6
#define PIC32MK_IRQ_IC2E        10
#define PIC32MK_IRQ_IC2         11
#define PIC32MK_IRQ_IC3E        15
#define PIC32MK_IRQ_IC3         16
#define PIC32MK_IRQ_IC4E        20
#define PIC32MK_IRQ_IC4         21
#define PIC32MK_IRQ_IC5E        25
#define PIC32MK_IRQ_IC5         26
#define PIC32MK_IRQ_IC6E        77
#define PIC32MK_IRQ_IC6         78
#define PIC32MK_IRQ_IC7E        81
#define PIC32MK_IRQ_IC7         82
#define PIC32MK_IRQ_IC8E        85
#define PIC32MK_IRQ_IC8         86
#define PIC32MK_IRQ_IC9E        89
#define PIC32MK_IRQ_IC9         90
#define PIC32MK_IRQ_IC10E       197
#define PIC32MK_IRQ_IC10        198
#define PIC32MK_IRQ_IC11E       200
#define PIC32MK_IRQ_IC11        201
#define PIC32MK_IRQ_IC12E       203
#define PIC32MK_IRQ_IC12        204
#define PIC32MK_IRQ_IC13E       206
#define PIC32MK_IRQ_IC13        207
#define PIC32MK_IRQ_IC14E       209
#define PIC32MK_IRQ_IC14        210
#define PIC32MK_IRQ_IC15E       212
#define PIC32MK_IRQ_IC15        213
#define PIC32MK_IRQ_IC16E       215
#define PIC32MK_IRQ_IC16        216

/* SPI1-6 IRQ numbers (Table 8-3, DS60001519E) */
#define PIC32MK_IRQ_SPI1_FAULT  35
#define PIC32MK_IRQ_SPI1_RX     36
#define PIC32MK_IRQ_SPI1_TX     37
#define PIC32MK_IRQ_SPI2_FAULT  53
#define PIC32MK_IRQ_SPI2_RX     54
#define PIC32MK_IRQ_SPI2_TX     55
#define PIC32MK_IRQ_SPI3_FAULT  154
#define PIC32MK_IRQ_SPI3_RX     155
#define PIC32MK_IRQ_SPI3_TX     156
#define PIC32MK_IRQ_SPI4_FAULT  166
#define PIC32MK_IRQ_SPI4_RX     167
#define PIC32MK_IRQ_SPI4_TX     168
#define PIC32MK_IRQ_SPI5_FAULT  169
#define PIC32MK_IRQ_SPI5_RX     170
#define PIC32MK_IRQ_SPI5_TX     171
#define PIC32MK_IRQ_SPI6_FAULT  172
#define PIC32MK_IRQ_SPI6_RX     173
#define PIC32MK_IRQ_SPI6_TX     174

/*
 * UART2–6 register base offsets from SFR base
 * UART1 is already defined as PIC32MK_UART1_OFFSET = 0x028000
 * TODO: verify exact offsets against DS60001519E Table 4-2.
 * -----------------------------------------------------------------------
 */

#define PIC32MK_UART2_OFFSET    0x028200u   /* UART2 (PER1 block) */
#define PIC32MK_UART3_OFFSET    0x048400u   /* UART3 (PER2 block, 0xBF848400) */
#define PIC32MK_UART4_OFFSET    0x048600u   /* UART4 (0xBF848600) */
#define PIC32MK_UART5_OFFSET    0x048800u   /* UART5 (0xBF848800) */
#define PIC32MK_UART6_OFFSET    0x048A00u   /* UART6 (0xBF848A00) */

#define PIC32MK_UART_BLOCK_SIZE 0x200u      /* per-UART SFR block */

/* Additional UxSTA bits */
#define PIC32MK_USTA_URXDA      (1u << 0)   /* RX data available */
#define PIC32MK_USTA_OERR       (1u << 1)   /* Overrun error */
#define PIC32MK_USTA_FERR       (1u << 2)   /* Framing error */
#define PIC32MK_USTA_PERR       (1u << 3)   /* Parity error */
#define PIC32MK_USTA_RIDLE      (1u << 4)   /* Receiver idle */
#define PIC32MK_USTA_UTXEN      (1u << 10)  /* TX enable */
#define PIC32MK_USTA_UTXISEL1   (1u << 14)  /* TX interrupt select */
#define PIC32MK_USTA_URXEN      (1u << 12)  /* RX enable */
#define PIC32MK_USTA_URXISEL1   (1u << 6)   /* RX interrupt select */
#define PIC32MK_UMODE_ON        (1u << 15)  /* UART enable */

/*
 * SPI peripheral registers (§23, DS60001519E)
 * TODO: verify exact base offsets.
 * -----------------------------------------------------------------------
 */

#define PIC32MK_SPI1_OFFSET     0x021800u
#define PIC32MK_SPI2_OFFSET     0x021A00u
#define PIC32MK_SPI3_OFFSET     0x040800u
#define PIC32MK_SPI4_OFFSET     0x040A00u
#define PIC32MK_SPI5_OFFSET     0x047800u   /* 0xBF847800 */
#define PIC32MK_SPI6_OFFSET     0x040E00u
#define PIC32MK_SPI_BLOCK_SIZE  0x200u

/* SPI register offsets within block */
#define PIC32MK_SPIxCON         0x00u
#define PIC32MK_SPIxSTAT        0x10u
#define PIC32MK_SPIxBUF         0x20u
#define PIC32MK_SPIxBRG         0x30u
#define PIC32MK_SPIxCON2        0x40u

/*
 * I2C peripheral registers (§24, DS60001519E)
 * TODO: verify exact base offsets.
 * -----------------------------------------------------------------------
 */

#define PIC32MK_I2C1_OFFSET     0x026000u   /* 0xBF826000 — §24, Table 4-2 */
#define PIC32MK_I2C2_OFFSET     0x026200u   /* 0xBF826200 */
#define PIC32MK_I2C3_OFFSET     0x046400u   /* 0xBF846400 (PER2 bank) */
#define PIC32MK_I2C4_OFFSET     0x046600u   /* 0xBF846600 */
#define PIC32MK_I2C_BLOCK_SIZE  0x200u

/* I2C register offsets within block */
#define PIC32MK_I2CxCON        0x00u
#define PIC32MK_I2CxSTAT       0x10u
#define PIC32MK_I2CxADD        0x20u
#define PIC32MK_I2CxMSK        0x30u
#define PIC32MK_I2CxTRN        0x40u
#define PIC32MK_I2CxRCV        0x50u

