patchew-project/qemu/include/hw/mips/pic32mk.h
/*
 * GPIO peripheral registers (§12, DS60001519E)
 * Base: PIC32MK_GPIO_OFFSET = 0x060000 (0xBF860000)
 * Each port (A–G) occupies 0x100 bytes.
 * -----------------------------------------------------------------------
 */

#define PIC32MK_GPIO_PORT_SIZE  0x100u      /* per-port register block */

/* GPIO register offsets within each port block */
#define PIC32MK_ANSEL           0x00u   /* Analog select */
#define PIC32MK_TRIS            0x10u   /* Direction (1=input) */
#define PIC32MK_PORT            0x20u   /* Read pin state */
#define PIC32MK_LAT             0x30u   /* Latch (write output) */
#define PIC32MK_ODC             0x40u   /* Open-drain control */
#define PIC32MK_CNPU            0x50u   /* Change-notice pull-up */
#define PIC32MK_CNPD            0x60u   /* Change-notice pull-down */
#define PIC32MK_CNCON           0x70u   /* Change-notice control */
#define PIC32MK_CNEN0           0x80u   /* CN edge enable 0 */
#define PIC32MK_CNSTAT          0x90u   /* CN status */
#define PIC32MK_CNEN1           0xA0u   /* CN edge enable 1 */
#define PIC32MK_CNF             0xB0u   /* CN flag */

/* Number of GPIO ports (A–G) */
#define PIC32MK_GPIO_NPORTS     7

/*
 * Set shared chardev for GPIO state-change event streaming.
 * Called from board init; multiple ports share the same Chardev*.
 */
void pic32mk_gpio_set_chardev(DeviceState *dev, Chardev *chr);
void pic32mk_oc_set_chardev(DeviceState *dev, Chardev *chr);

/*
 * DMA controller registers (§26, DS60001519E)
 * Base: PIC32MK_DMA_OFFSET = 0x011000 (within EVIC page, 0xBF811000)
 * Global registers at base, then 8 channel blocks at +0x60 each.
 * -----------------------------------------------------------------------
 */

/* DMA global registers */
#define PIC32MK_DMACON_OFFSET   0x00u   /* DMA control */
#define PIC32MK_DMASTAT_OFFSET  0x10u   /* DMA status */
#define PIC32MK_DMAADDR_OFFSET  0x20u   /* DMA address */

/* DMA channel registers base: +0x60 + channel * 0xC0 */
#define PIC32MK_DMA_CH_BASE     0x60u
#define PIC32MK_DMA_CH_STRIDE   0xC0u
#define PIC32MK_DMA_NCHANNELS   8

/* DMA channel register offsets within each channel block */
#define PIC32MK_DCHxCON         0x00u
#define PIC32MK_DCHxECON        0x10u
#define PIC32MK_DCHxINT         0x20u
#define PIC32MK_DCHxSSA         0x30u
#define PIC32MK_DCHxDSA         0x40u
#define PIC32MK_DCHxSSIZ        0x50u
#define PIC32MK_DCHxDSIZ        0x60u
#define PIC32MK_DCHxSPTR        0x70u
#define PIC32MK_DCHxDPTR        0x80u
#define PIC32MK_DCHxCSIZ        0x90u
#define PIC32MK_DCHxCPTR        0xA0u
#define PIC32MK_DCHxDAT         0xB0u

/*
 * ADCHS peripheral registers (§22, DS60001519E)
 * Base: 0xBF887000 (SFR offset 0x087000)
 * Register block spans ~4 KB (0x000–0xE1C).
 * Each register has SET/CLR/INV aliases at +4/+8/+C.
 * -----------------------------------------------------------------------
 */

#define PIC32MK_ADC_OFFSET      0x087000u   /* 0xBF887000 */
#define PIC32MK_ADC_SIZE        0x001000u   /* 4 KB register window */

/* Control registers */
#define PIC32MK_ADCCON1         0x000u
#define PIC32MK_ADCCON2         0x010u
#define PIC32MK_ADCCON3         0x020u
#define PIC32MK_ADCTRGMODE      0x030u

/* Input mode control (signed/unsigned per channel group) */
#define PIC32MK_ADCIMCON1       0x040u
#define PIC32MK_ADCIMCON2       0x050u
#define PIC32MK_ADCIMCON3       0x060u
#define PIC32MK_ADCIMCON4       0x070u

/* Global interrupt enable (result ready, 2 × 32 bits) */
#define PIC32MK_ADCGIRQEN1      0x080u
#define PIC32MK_ADCGIRQEN2      0x090u

/* Channel scan select */
#define PIC32MK_ADCCSS1         0x0A0u
#define PIC32MK_ADCCSS2         0x0B0u

/* Data ready status */
#define PIC32MK_ADCDSTAT1       0x0C0u
#define PIC32MK_ADCDSTAT2       0x0D0u

/* Compare enable */
#define PIC32MK_ADCCMPEN1       0x0E0u
#define PIC32MK_ADCCMPEN2       0x100u
#define PIC32MK_ADCCMPEN3       0x120u
#define PIC32MK_ADCCMPEN4       0x140u

/* Compare values */
#define PIC32MK_ADCCMP1         0x0F0u
#define PIC32MK_ADCCMP2         0x110u
#define PIC32MK_ADCCMP3         0x130u
#define PIC32MK_ADCCMP4         0x150u

/* Digital filter registers */
#define PIC32MK_ADCFLTR1        0x1A0u
#define PIC32MK_ADCFLTR2        0x1B0u
#define PIC32MK_ADCFLTR3        0x1C0u
#define PIC32MK_ADCFLTR4        0x1D0u

/* Trigger configuration */
#define PIC32MK_ADCTRG1         0x200u
#define PIC32MK_ADCTRG2         0x210u
#define PIC32MK_ADCTRG3         0x220u
#define PIC32MK_ADCTRG4         0x230u
#define PIC32MK_ADCTRG5         0x240u
#define PIC32MK_ADCTRG6         0x250u
#define PIC32MK_ADCTRG7         0x260u

/* Compare control */
#define PIC32MK_ADCCMPCON1      0x280u
#define PIC32MK_ADCCMPCON2      0x290u
#define PIC32MK_ADCCMPCON3      0x2A0u
#define PIC32MK_ADCCMPCON4      0x2B0u

/* Misc registers */
#define PIC32MK_ADCBASE         0x300u
#define PIC32MK_ADCTRGSNS       0x340u

/* Sampling time (per-module) */
#define PIC32MK_ADC0TIME        0x350u
#define PIC32MK_ADC1TIME        0x360u
#define PIC32MK_ADC2TIME        0x370u
#define PIC32MK_ADC3TIME        0x380u
#define PIC32MK_ADC4TIME        0x390u
#define PIC32MK_ADC5TIME        0x3A0u

/* Early interrupt enable / status */
#define PIC32MK_ADCEIEN1        0x3C0u
#define PIC32MK_ADCEIEN2        0x3D0u
#define PIC32MK_ADCEISTAT1      0x3E0u
#define PIC32MK_ADCEISTAT2      0x3F0u

/* Analog module enable / warm-up control */
#define PIC32MK_ADCANCON        0x400u

/* Conversion data registers (stride 0x10 per channel index) */
#define PIC32MK_ADCDATA_BASE    0x600u
#define PIC32MK_ADCDATA_STRIDE  0x010u

/* Per-module configuration */
#define PIC32MK_ADC0CFG         0xD00u
#define PIC32MK_ADC1CFG         0xD10u
#define PIC32MK_ADC2CFG         0xD20u
#define PIC32MK_ADC3CFG         0xD30u
#define PIC32MK_ADC4CFG         0xD40u
#define PIC32MK_ADC5CFG         0xD50u
#define PIC32MK_ADC6CFG         0xD60u
#define PIC32MK_ADC7CFG         0xD70u

/* System configuration */
#define PIC32MK_ADCSYSCFG0      0xE00u
#define PIC32MK_ADCSYSCFG1      0xE10u

/* Maximum channel index (0–53, with gaps) */
#define PIC32MK_ADC_MAX_CH      54

/* ADCCON1 bits */
#define PIC32MK_ADCCON1_ON      (1u << 15)

/* ADCCON2 bits */
#define PIC32MK_ADCCON2_BGVRRDY (1u << 31)  /* Band-gap voltage ref ready */
#define PIC32MK_ADCCON2_REFFLT  (1u << 30)  /* Reference fault */

