patchew-project/qemu/include/hw/mips/pic32mk.h
/* ADCCON3 bits */
#define PIC32MK_ADCCON3_ADINSEL_MASK  0x3Fu        /* bits [5:0] channel select */
#define PIC32MK_ADCCON3_RQCNVRT (1u << 8)          /* Request conversion */
#define PIC32MK_ADCCON3_GSWTRG  (1u << 6)          /* Global software trigger */
#define PIC32MK_ADCCON3_GLSWTRG (1u << 5)          /* Global level SW trigger */
#define PIC32MK_ADCCON3_DIGEN_SHIFT  16             /* DIGENx at bits [23:16] */

/* ADCANCON bits — ANENx and WKRDYx (modules 0–5, 7) */
#define PIC32MK_ADCANCON_ANEN_SHIFT   0             /* ANENx at bits [7:0] */
#define PIC32MK_ADCANCON_WKRDY_SHIFT  8             /* WKRDYx at bits [15:8] */

/*
 * ADCHS interrupt source numbers (§8, Table 8-1) — vector/IRQ numbers
 * -----------------------------------------------------------------------
 */

#define PIC32MK_IRQ_ADC         92   /* Main ADC interrupt */
#define PIC32MK_IRQ_ADC_DC1     94   /* Digital comparator 1 */
#define PIC32MK_IRQ_ADC_DC2     95   /* Digital comparator 2 */
#define PIC32MK_IRQ_ADC_DF1     96   /* Digital filter 1 */
#define PIC32MK_IRQ_ADC_DF2     97   /* Digital filter 2 */
#define PIC32MK_IRQ_ADC_DF3     98   /* Digital filter 3 */
#define PIC32MK_IRQ_ADC_DF4     99   /* Digital filter 4 */
#define PIC32MK_IRQ_ADC_FAULT   100  /* ADC fault */
#define PIC32MK_IRQ_ADC_EOS     101  /* End of scan */
#define PIC32MK_IRQ_ADC_ARDY    102  /* Analog ready */
#define PIC32MK_IRQ_ADC_URDY    103  /* Update ready */
#define PIC32MK_IRQ_ADC_DMA     104  /* DMA */
#define PIC32MK_IRQ_ADC_EARLY   105  /* Early interrupt */
#define PIC32MK_IRQ_ADC_DATA0   106  /* Data ready channel 0 (base) */
/* DATA1..DATA27 = 107..133, DATA33..41 = 139..147, DATA45..53 = 151..159 */
#define PIC32MK_IRQ_ADC_DC3     245  /* Digital comparator 3 */
#define PIC32MK_IRQ_ADC_DC4     246  /* Digital comparator 4 */

/*
 * NVM / Flash Controller (§10, DS60001519E)
 * Base: 0xBF800A00 (SFR offset 0x000A00)
 * Register block: NVMCON, NVMKEY, NVMADDR, NVMDATA0–3, NVMSRCADDR,
 * NVMPWP, NVMBWP, NVMCON2 (each 0x10 stride with SET/CLR/INV aliases,
 * except NVMKEY which is write-only, no aliases).
 * -----------------------------------------------------------------------
 */

#define PIC32MK_NVM_OFFSET      0x000A00u   /* 0xBF800A00 */
#define PIC32MK_NVM_SIZE        0x0000B0u   /* NVMCON..NVMCON2+INV inclusive */

/* Register offsets within the NVM block */
#define PIC32MK_NVMCON          0x00u       /* +CLR/SET/INV at +4/+8/+C */
#define PIC32MK_NVMKEY          0x10u
#define PIC32MK_NVMADDR         0x20u       /* +CLR/SET/INV */
#define PIC32MK_NVMDATA0        0x30u       /* +CLR/SET/INV */
#define PIC32MK_NVMDATA1        0x40u
#define PIC32MK_NVMDATA2        0x50u
#define PIC32MK_NVMDATA3        0x60u
#define PIC32MK_NVMSRCADDR      0x70u       /* +CLR/SET/INV */
#define PIC32MK_NVMPWP          0x80u
#define PIC32MK_NVMBWP          0x90u
#define PIC32MK_NVMCON2         0xA0u

/* NVMCON bits */
#define PIC32MK_NVMCON_NVMOP_MASK  0x000Fu  /* bits [3:0] */
#define PIC32MK_NVMCON_BFSWAP     (1u << 6)
#define PIC32MK_NVMCON_PFSWAP     (1u << 7)
#define PIC32MK_NVMCON_LVDERR     (1u << 12)
#define PIC32MK_NVMCON_WRERR      (1u << 13)
#define PIC32MK_NVMCON_WREN       (1u << 14)
#define PIC32MK_NVMCON_WR         (1u << 15)

/* NVM operation codes (NVMOP field, bits [3:0]) */
#define PIC32MK_NVMOP_NOP              0x0u
#define PIC32MK_NVMOP_WORD_PROG        0x1u
#define PIC32MK_NVMOP_QUAD_WORD_PROG   0x2u
#define PIC32MK_NVMOP_ROW_PROG         0x3u
#define PIC32MK_NVMOP_PAGE_ERASE       0x4u
#define PIC32MK_NVMOP_LOWER_PFM_ERASE  0x5u
#define PIC32MK_NVMOP_UPPER_PFM_ERASE  0x6u
#define PIC32MK_NVMOP_PFM_ERASE        0x7u

/* Unlock keys (written sequentially to NVMKEY) */
#define PIC32MK_NVMKEY1         0xAA996655u
#define PIC32MK_NVMKEY2         0x556699AAu

/* Flash geometry */
#define PIC32MK_NVM_PAGE_SIZE   4096u       /* erase granularity */
#define PIC32MK_NVM_ROW_SIZE    512u        /* write-row granularity */

/* Interrupt — Flash Control Error vector 31 */
#define PIC32MK_IRQ_FCE         31

/*
 * Data EEPROM (§11, DS60001519E)
 * Base: 0xBF829000 (SFR offset 0x029000)
 * Register block: EECON, EEKEY, EEADDR, EEDATA (each 0x10 stride with
 * SET/CLR/INV aliases, except EEKEY which is write-only, no aliases).
 * -----------------------------------------------------------------------
 */

#define PIC32MK_DATAEE_OFFSET   0x029000u   /* 0xBF829000 */
#define PIC32MK_DATAEE_SIZE     0x000040u   /* EECON..EEDATA+INV inclusive */

/* Register offsets within the DATAEE block */
#define PIC32MK_EECON           0x00u
#define PIC32MK_EEKEY           0x10u
#define PIC32MK_EEADDR          0x20u
#define PIC32MK_EEDATA_REG      0x30u       /* "_REG" avoids clash with EEDATA macro */

/* EECON bits (p32mk1024mcm100.h) */
#define PIC32MK_EECON_CMD_MASK  0x00000007u /* bits [2:0] */
#define PIC32MK_EECON_CMD_SHIFT 0
#define PIC32MK_EECON_ILW       (1u << 3)
#define PIC32MK_EECON_ERR_MASK  0x00000030u /* bits [5:4] */
#define PIC32MK_EECON_ERR_SHIFT 4
#define PIC32MK_EECON_WREN      (1u << 6)
#define PIC32MK_EECON_RW        (1u << 7)
#define PIC32MK_EECON_ABORT     (1u << 12)
#define PIC32MK_EECON_SIDL      (1u << 13)
#define PIC32MK_EECON_RDY       (1u << 14)
#define PIC32MK_EECON_ON        (1u << 15)

/* EEADDR valid bits — 14-bit, word-aligned */
#define PIC32MK_EEADDR_MASK     0x00003FFCu

/* EEPROM storage geometry */
#define PIC32MK_DATAEE_WORDS        1024    /* 4 KB = 1024 × 32-bit words */
#define PIC32MK_DATAEE_PAGE_WORDS   32      /* 128-byte page */

/* Unlock keys (written sequentially to EEKEY) */
#define PIC32MK_EEKEY1          0xEDB7u
#define PIC32MK_EEKEY2          0x1248u

/* EECON CMD field values */
#define PIC32MK_EECMD_WORD_READ     0
#define PIC32MK_EECMD_WORD_WRITE    1
#define PIC32MK_EECMD_PAGE_ERASE    2
#define PIC32MK_EECMD_BULK_ERASE    3
#define PIC32MK_EECMD_CONFIG_WRITE  4

/* Interrupt — Data EEPROM vector 186 */
#define PIC32MK_IRQ_DATAEE      186

#endif /* HW_MIPS_PIC32MK_H */
